app/controllers/features_controller.rb

SELECT * FROM `features` WHERE (`features`.`project_id` IS NULL)
---
  def index
    @features = Feature.all({:conditions => {:project_id => params[:project_id]}})

SELECT * FROM `features` WHERE (`features`.`id` = 1)
---
  def show
    @feature = Feature.find(params[:id])

INSERT INTO `features` (`so_that`, `created_at`, `title`, `as_a`, `project_id`, `updated_at`, `i_want`, `status`) VALUES(NULL, '2010-11-27 03:45:20', NULL, NULL, NULL, '2010-11-27 03:45:20', NULL, NULL)
---
  def create
    @feature = Feature.new(params[:feature])

    respond_to do |format|
      if @feature.save

SELECT * FROM `features` WHERE (`features`.`id` = 1)
UPDATE `features` SET `updated_at` = '2010-12-04 21:26:24', `as_a` = 'um programador', `so_that` = 'Para passar no validador', `i_want` = 'preencher esse form' WHERE `id` = 1
---
  def update
    @feature = Feature.find(params[:id])

    respond_to do |format|
      if @feature.update_attributes(params[:feature])

SELECT * FROM `features` WHERE (`features`.`id` = 13)
DELETE FROM `features` WHERE `id` = 13
---
  def destroy
    @feature = Feature.find(params[:id])
    @feature.destroy