app/controllers/projects_controller.rb

SELECT * FROM `projects`
---
  def index
    @projects = Project.all

SELECT * FROM `projects` WHERE (`projects`.`id` = 1)
---
  def show
    @project = Project.find(params[:id])

INSERT INTO `projects` (`name`, `created_at`, `updated_at`) VALUES('Milfont', '2010-11-15 18:38:13', '2010-11-15 18:38:13')
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save